Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པའི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བྲིས་ཤིང་། བཅངས་པ་དེ་དག་ལ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་བ་དང་།
en: If you ask why, it is because, in order to worship this perfection of wisdom, the gods of the great trichiliocosm, including those of the Caturmahā­rāja­kāyika, Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, and all the other gods up to and including those of Akaniṣṭha, and also the gods of immeasurable countless world systems, including those of their Caturmahā­rāja­kāyika, Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, and Brahma­pariṣadya realms, and all the other gods, up to and including those of Akaniṣṭha, as many as there are, will always guard, shelter, and nurture without interruption those noble sons or noble daughters who have committed to writing and upheld this perfection of wisdom. {

source: བསྐྱབ་པ་དང་།
en: Ki.

source: བསྐྱང་བ་བྱེད་དེ། ལྷའི་བུ་དེ་དག་འོངས་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བྱས་ཤིང་འདོད་པར་འགྱུར་ཏེ།
en: II-III: 56} Once those gods have arrived there, they will serve, respect, honor, and worship this perfection of wisdom, and they will then depart.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ། བཅངས་ན་དེ་ལ་ཚེ་འདིའི་ཡོན་ཏན་དང་། ལེགས་པ་འདི་དག་ཡོད་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Kauśika, so it is that if any commit to writing and uphold this perfection of wisdom, they will have such qualities and excellent advantages in this life. “

source: སྙིང་པོ་བྱང་ཆུབ་བམ། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་འཁོར་ཏམ། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ནང་ན་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སྲོག་ཆགས་སམ། མིར་གྱུར་པ་གང་སུ་འདུག་ཀྱང་རུང་སྟེ། དེ་དག་ལ་མིའམ་མི་མ་ཡིན་པས་གཙེ་བའམ།
en: Kauśika, similarly, those who have gone to the site of enlightenment, those in the retinue at the site of enlightenment, or whichever animals or human beings are present in the vicinity of the site of enlightenment, cannot be harmed or injured by human or nonhuman beings.

source: ཐོ་འཚམ་བར་མི་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་དེ་ལ་བཞུགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: If you ask why, it is because, seated thereon, the tathāgatas, arhats, completely awakened buddhas of the past have indeed attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །གང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཀྱང་། དེ་ཉིད་དུ་བཞུགས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Seated thereon, the tathāgatas, arhats, completely awakened buddhas of the future and the present will indeed attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་བཞུགས་པ་དེ་དག་ཀྱང་དེ་ཉིད་ལ་བཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱིས།
en: Seated thereon, even the tathāgatas, arhats, completely awakened buddhas who are alive at present in the world systems of the ten directions are attaining consummate buddhahood in unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་མེད་པ་དང་། ཁོ་ན་མེད་པ་དང་། གཅུགས་མེད་པར་ནན་ཏན་མཛད་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ལ་བཀོད་པར་གྱུར་ཏོ། །བཀོད་དོ། །དགོད་པར་འགྱུར་རོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་པར་གྱུར་ཏོ། །བཀོད་དོ། །དགོད་པར་འགྱུར་རོ།
en: And even after all these tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood in unsurpassed, complete enlightenment, earnestly rendering all beings fearless, free from enmity, and without ties, they have established, are establishing, and will establish immeasurable, countless beings in the excellence of the gods and humans; and they have established, are establishing, and will establish them in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and in arhatship, individual enlightenment, and unsurpassed, complete enlightenment.

source: །ཀཽ་ཤི་ཀ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཀྱིས་སའི་ཕྱོགས་དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་བྱས་པས་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་ཕྱག་བྱ་བ་དང་། གདུད་པ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བར་གྱུར་ཏོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བགྱིས་ཏེ་བཅངས་ལ། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིས་པ་དང་།
en: If you ask why, Kauśika, this very perfection of wisdom makes its location into an offering shrine for all beings, which is to be venerated, offered to, and respected with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons.”

source: གང་ལ་ལས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་དུ་སྩལ་ཏེ། མཆོད་དམ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྣོད་དུ་སྩལ་ཏེ། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: Śakra then asked, “Blessed Lord, if there were a noble son or noble daughter who were to commit this perfection of wisdom to writing, keep it in the form of a book, and serve, respect, honor, and make offerings to it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons, and if there were another who would dedicate the bone relics of a tathāgata, arhat, completely awakened buddha within a stūpa fashioned of the seven kinds of precious materials, that is to say in a reliquary or container fashioned of the seven precious materials, and then serve, respect, honor, and make offerings to it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons, which of these two would increase manifold their stock of merit?” {

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིས་ན། དེ་གཉིས་ལས་གང་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་འཕེལ་བ་ལགས།
en: Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ན་དེ་ཁྱོད་ཉིད་ལ་དྲིས། ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལུང་སྟོན་ཅིག །
en: II-III: 57} “Kauśika,” replied the Blessed One, “I will ask you a counter-question on this matter and you should answer as best you can!

source: ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་པ་དང་། སྐུ་འདི་ལྟ་བུ་མངོན་པར་གྲུབ་པ་དེ་ལམ་གང་ལ་བསླབས་པས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་ཏེ།
en: Kauśika, in which path do you think the tathāgatas, arhats, completely awakened buddhas who have acquired all-aspect omniscience and manifested such a physical body have trained in order to acquire all-aspect omniscience and manifest such a physical body?”

source: སྐུ་འདི་ལྟ་བུ་མངོན་པར་གྲུབ་པར་གྱུར། བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་ཏེ་སྐུ་འདི་ལྟ་བུ་ཡང་མངོན་པར་གྲུབ་བོ།
en: Śakra answered, “Blessed Lord, it is after training in this very perfection of wisdom that the tathāgatas, arhats, completely awakened buddhas acquire all-aspect omniscience and also manifest such a physical body.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Kauśika, it is so! It is so!” replied the Blessed One. “

source: ངས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་སོ། །སྐུ་འདི་འདྲ་བ་ཡང་མངོན་པར་གྲུབ་བོ།
en: It was after training in this very perfection of wisdom that I acquired all-aspect omniscience and also myself manifested such a physical body.

source: །ཀཽ་ཤི་ཀ་ངའི་སྐུ་འདི་བརྙེས་པ་ནི། དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་གྲངས་སུ་ཡང་མི་འགྲོ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་པས། དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ།
en: Kauśika, it is not because of acquiring a body like this one of mine that the tathāgatas come to be categorized as tathāgatas; it is because of acquiring all-aspect omniscience that the tathāgatas come to be categorized as tathāgatas.

source: །ཀཽ་ཤི་ཀ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་ངོ་།
en: Kauśika, all-aspect omniscience has originated from the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ལུས་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་གཞི་སྟེ།
en: Kauśika, a body such as this is the basis of the wisdom of all-aspect omniscience.

source: གཞི་དེ་ལ་བརྟེན་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་སོ།
en: Depending on that basis, the tathāgatas, arhats, completely awakened buddhas have acquired all-aspect omniscience.

source: །དེ་ལྟ་བས་ན་སྐུ་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དེའི་གཞིར་གྱུར་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་གྱུར་ཅིང་ཕྱག་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་།
en: So, it is because this body is the basis of the wisdom of all-aspect omniscience that it becomes a shrine for all beings, and is to be paid homage, revered, presented with offerings, served, and respected.

source: བཀུར་སྟིར་བྱ་བར་གྱུར་ཏེ། ཀཽ་ཤི་ཀ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: Kauśika, after I have passed into final nirvāṇa, my bone relics will be worshiped.

source: སྐུ་གདུང་མཆོད་པ་ཡང་སྐུ་ལ་མཆོད་པ་ཉིད་དུ་འགྱུར་གྱི། ཆོས་ལ་མཆོད་པར་མི་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུའམ།
en: Indeed my bone relics will themselves become a shrine, but my Dharma will not become a shrine. “

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱས་པས་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ།
en: Kauśika, any noble son or noble daughter who were to commit this perfection of wisdom to writing, and uphold, recite, master, and focus their attention correctly on it, and were to serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons would worship the wisdom of all-aspect omniscience.

source: རིགས་ཀྱི་བུ་མོ་དད་པ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བྲིས་ཏེ། གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ། །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ། །མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: So it is, Kauśika, that any noble son or noble daughter who wishes to make offerings to the tathāgatas should commit this perfection of wisdom to writing and uphold, recite, master, and focus their attention correctly on it, and should serve, respect, honor, and make offerings to it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons. {

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོར་བྱའོ།།བཀུར་སྟིར་བྱའོ། །བསྟི་སྟང་དུ་བྱའོ།
en: Ki.

source: །མཆོད་པར་བྱའོ། །ཀཽ་ཤི་ཀ་གང་ལ་ལས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་དུ་བཅུག་གམ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྣོད་དུ་བླུགས་ཤིང་གཅེས་པར་བྱས་ཏེ། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་མཆོད་པ་བྱས་པ་བས། གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ། བཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱས་ན། འདི་ཉིད་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: II-III: 58} “Kauśika, if there were another who would insert the bone relics of a tathāgata who has passed into final nirvāṇa within a stūpa fashioned of the seven precious materials, or place it within a container fashioned of the seven precious materials, and honor it, serving, respecting, honoring, and worshiping it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons, the one who has committed this perfection of wisdom to writing, and upheld, recited, mastered, and focused attention correctly on it, serving, respecting, honoring, and worshiping it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons, would increase manifold their stock of merit more than the other.

source: །ཀཽ་ཤི་ཀ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཡང་འདི་ལས་བྱུང་ངོ་། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་འདི་ལས་བྱུང་ངོ་། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If you ask why, Kauśika, the five [lesser] perfections have originated from it.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་འདི་ལས་བྱུང་ངོ་། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཡང་འདི་ལས་བྱུང་ངོ་། །སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་ཡང་འདི་ལས་བྱུང་ངོ་།
en: The emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas also have originated from it.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རིགས་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུགས་ཕུན་སུམ་ཚོགས་པ་དང་། ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོར་ཕུན་སུམ་ཚོགས་པ་ཡང་འདི་ལས་བྱུང་ངོ་། །བྱམས་པ་ཆེན་པོ་ཡང་འདི་ལས་བྱུང་ངོ་། །སྙིང་རྗེ་ཆེན་པོ་ཡང་འདི་ལས་བྱུང་ངོ་། །རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འ
en: The maturation of beings has also originated from it, the excellence of the buddhafields has also originated from it, the spiritual family of bodhisattva great beings has also originated from it, the excellence of physical form has also originated from it, the excellence of resources has also originated from it, the excellence of the retinue has also originated from it, great loving kindness has also originated from it, great compassion has also originated from it, and great and lofty royal families, great and lofty priestly families, great and lofty householder families, the gods of the Caturmahā­rāja­kāyika realm and the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin realms, and [all other realms], up to and including Akaniṣṭha, have also originated from this.

source: ཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱང་འདི་ལས་བྱུང་ངོ་། །རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་འདི་ལས་བྱུང་ངོ་།
en: Those who have entered the stream to nirvāṇa, those who are destined for only one more rebirth, those who are no longer subject to rebirth, those who are arhats, pratyekabuddhas, bodhisattvas, and the all-aspect omniscience of the tathāgatas, arhats, completely awakened buddhas have also originated from this.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་བ། བཅོམ་ལྡན་འདས་འཛམ་བུའི་གླིང་གི་མི་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་རིམ་གྲོ་མི་བགྱིད། བཀུར་སྟི་མི་བགྱིད། བསྟི་སྟང་མི་བགྱིད། མཆོད་པར་མི་བགྱིད་པ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་པ་དེ་ལྟར་མཐུ་ཆེ་བར་མ་འཚལ་ཏམ།
en: Śakra then asked, “Blessed Lord, do those human beings of Jambudvīpa who do not serve, do not honor, do not respect, and do not worship this perfection of wisdom not know that the offerings made to the perfection of wisdom are more powerful?” {Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། འཛམ་བུའི་གླིང་གི་མི་དེ་དག་ལས་སངས་རྒྱས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། གང་ཆོས་དང་། དགེ་འདུན་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་།
en: II-III: 59} “Kauśika,” replied the Blessed One, “among those human beings of Jambudvīpa, how many do you think have unbroken devotion to the buddhas, unbroken devotion to the Dharma, and unbroken devotion to the saṅgha?

source: གང་སངས་རྒྱས་ལ་ནེམ་ནུར་མེད་པ་དང་། གང་ཆོས་དང་། དགེ་འདུན་ལ་ནེམ་ནུར་མེད་པ་དང་།
en: How many are without hesitation concerning the buddhas, without hesitation concerning the Dharma, and without hesitation concerning the saṅgha?

source: གང་སངས་རྒྱས་ལ་ཤིན་དུ་རྟོན་པ་དང་། གང་ཆོས་དང་། དགེ་འདུན་ལ་ཤིན་དུ་རྟོན་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many are utterly convinced about the buddhas, utterly convinced about the Dharma, and utterly convinced about the saṅgha?”

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འཛམ་བུའི་གླིང་གི་མི་གང་སངས་རྒྱས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། གང་ཆོས་དང་།
en: Śakra answered, “Blessed Lord, there are few human beings of Jambudvīpa who have unbroken devotion to the buddhas, unbroken devotion to the Dharma.

source: དགེ་འདུན་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། གང་སངས་རྒྱས་ལ་ནེམ་ནུར་མ་མཆིས་པ་དང་། གང་ཆོས་དང་དགེ་འདུན་ལ་ནེམ་ནུར་མ་མཆིས་པ་དང་། གང་སངས་རྒྱས་ལ་ཤིན་དུ་རྟོན་པ་དང་། གང་ཆོས་དང་།
en: and unbroken devotion to the saṅgha; who are without hesitation concerning the buddhas, without hesitation concerning the Dharma, and without hesitation concerning the saṅgha; and who are utterly convinced about the buddhas, utterly convinced about the Dharma, and utterly convinced about the saṅgha.”

source: དགེ་འདུན་ལ་ཤིན་དུ་རྟོན་པ་དེ་ལྟ་བུ་ནི་ཉུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། འཛམ་བུའི་གླིང་གི་མི་ལས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: The Blessed One then asked, “Kauśika, among those human beings of Jambudvīpa, how many do you think have attained the thirty-seven factors conducive to enlightenment?

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have attained the three gateways of liberation?

source: རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have attained the eight aspects of liberation?

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have attained the nine serial steps of meditative absorption?

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have attained the four kinds of exact knowledge?

source: མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have attained the six extrasensory powers?

source: འཛམ་བུའི་གླིང་གི་མི་ལས་ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པའི་ཕྱིར། རྒྱུན་དུ་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: Among those human beings of Jambudvīpa, how many do you think have entered the stream to nirvāṇa in order to abandon the three fetters?

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many are destined for only one more rebirth in order to wear down desire, hatred, and delusion?

source: དམ་པ་མ་ཡིན་པའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར། ཕྱིར་མི་འོང་བར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many are no longer subject to rebirth in order to abandon the five fetters associated with the lower realms?

source: བླ་མའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར། དགྲ་བཅོམ་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have become arhats in order to abandon the five fetters associated with the higher realms?

source: རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have actually entered upon individual enlightenment?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have actually entered upon unsurpassed, complete enlightenment?” “

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། འཛམ་བུའི་གླིང་གི་མི་ལ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: Blessed Lord,” replied Śakra, “there are few human beings of Jambudvīpa who have attained the thirty-seven factors conducive to enlightenment.

source: །དེ་བས་ཀྱང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the three gateways of liberation.

source: །དེ་བས་ཀྱང་རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the eight aspects of liberation.

source: །དེ་བས་ཀྱང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the nine serial steps of meditative absorption.

source: །དེ་བས་ཀྱང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the four kinds of exact knowledge.

source: །དེ་བས་ཀྱང་མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the six extrasensory powers.

source: །དེ་བས་ཀྱང་འཛམ་བུའི་གླིང་གི་མི་ལས་ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པའི་སླད་དུ། རྒྱུན་དུ་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer among the human beings of Jambudvīpa who have entered the stream to nirvāṇa in order to abandon the three fetters.

source: །དེ་བས་ཀྱང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པའི་སླད་དུ། ལན་ཅིག་ཕྱིར་འོང་བར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who are destined for only one more rebirth in order to wear down desire, hatred, and delusion. {

source: །དེ་བས་ཀྱང་དམ་པ་མ་ལགས་པའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་སླད་དུ། ཕྱིར་མི་འོང་བར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: Ki.II-III: 60} There are even fewer who are no longer subject to rebirth in order to abandon the five fetters associated with the lower realms.

source: །དེ་བས་ཀྱང་བླ་མའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་སླད་དུ། དགྲ་བཅོམ་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have become arhats in order to abandon the five fetters associated with the higher realms.
